// 1) Дана строка 'Я-учу-javascript!'. Замените все дефисы на ' '.

// const str = 'Я-учу-javascript!'
// console.log(str.replaceAll('-', ' '))



// 2) Запросить 2 строки и сравнивнить их длину. Вывести 1, если в первой строке больше символов, чем во второй; -1 – если во второй больше символов, чем в первой; или 0 – если строки одинаковой длины.

// let str1 = prompt('Введите первую строку')
// let str2 = prompt('Введите вторую строку')

// if(str1.length > str2.length) {
//     console.log('1')
// } else if (str1.length < str2.length) {
//     console.log('-1')
// } else {
//     console.log('0')
// }



// 3) Запросите строку из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий.

// let str = prompt('Введите число из трёх символов')
// let sum = 0

// for (let i = 0; i < str.length; i++) {
//     sum += +str[i]
// }
// console.log(sum)